app/controllers/job_seekers_controller.rb

  def index
    if params[:f_name].present?
      users = UserProfile.search_user_by_name(params[:f_name]).page(params[:page]).per(2)
      render json: users
    else
      users = UserProfile.page(params[:page]).per(2)
---
SELECT "user_profiles".* FROM "user_profiles" WHERE (f_name LIKE 'ra%') LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT "user_profiles".* FROM "user_profiles" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]