app/controllers/job_recruiters_controller.rb

  def accept_or_reject_job_application
    if @current_user == @application.job.user
      if @application.update(status:params[:status])
---
UPDATE "user_applications" SET "updated_at" = ?, "status" = ? WHERE "user_applications"."id" = ?  [["updated_at", "2023-09-08 14:01:48.437447"], ["status", "reject"], ["id", 8]]

  def set_param
    @application= UserApplication.find_by_id(params[:id])
---
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]