app/controllers/user_profiles_controller.rb

  def create
    profile = @current_user.build_user_profile(user_profile_param)
    if profile.save
---
INSERT INTO "user_profiles" ("f_name", "l_name", "skills", "experience", "education", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "user_profiles" SET "updated_at" = ? WHERE "user_profiles"."id" = ?  [["updated_at", "2023-09-13 11:15:05.526686"], ["id", 29]]

  def update
    if @user_profile.update(user_profile_param)
---
UPDATE "user_profiles" SET "l_name" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["l_name", "kushwah"], ["updated_at", "2023-09-06 07:32:21.248012"], ["id", 1]]

  def destroy
    if @user_profile.destroy
---
DELETE FROM "user_profiles" WHERE "user_profiles"."id" = ?  [["id", 32]]