app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ritik123@gmail.com"], ["LIMIT", 1]]
---
  def login
    # debugger
    user = User.find_by_email(params[:email])

SELECT "users".* FROM "users"
---
  def index
    # debugger
    @users = User.all

INSERT INTO "users" ("user_name", "password_digest", "email", "type", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    byebug
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "user_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "ritikdhote"], ["updated_at", "2023-10-12 10:11:35.328070"], ["id", 21]]
---
  def update
    debugger
    if @current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
    if @current_user.destroy