app/controllers/users_application_controller.rb

SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."user_id" = ?  [["user_id", 3]]
---
  def index
    seeker_all_applications=@current_user.user_applications.page(params[:page]).per(2)

INSERT INTO "user_applications" ("job_id", "user_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["job_id", 10], ["user_id", 23], ["created_at", "2023-09-18 11:14:43.302975"], ["updated_at", "2023-09-18 11:14:43.302975"], ["status", "applied"]]
---
  def create
    application = @current_user.user_applications.new(user_application_param)
    if application.save

DELETE FROM "user_applications" WHERE "user_applications"."id" = ?  [["id", 11]]
---
  def destroy
    byebug
    if @user_application.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."user_id" = ? AND "user_applications"."id" = ? LIMIT ?  [["user_id", 3], ["id", 22], ["LIMIT", 1]]
---
  def set_param
    @user_application = @current_user.user_applications.find_by_id(params[:id])